kleytonzotti/lvgl_porting/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-LCD-4.3B usa o modulo ESP32-S3-N16R8:
# 16MB Flash + 8MB PSRAM Octal. Config aqui e a mesma do demo oficial
# da Waveshare (ESP32-S3-Touch-LCD-4.3B-BOX-Demo/08_lvgl_Porting) para
# este chip; PSRAM em modo Quad/40M corrompe o framebuffer (fica na PSRAM
# e o painel RGB faz DMA continuo dela).
CONFIG_IDF_TARGET="esp32s3"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# FETCH_INSTRUCTIONS/RODATA (ligados no demo oficial da Waveshare) fazem
# codigo e constantes rodarem direto da PSRAM — competindo pelo MESMO
# barramento que o framebuffer do LCD usa o tempo todo. Isso bate com o
# sintoma reportado (tela embaralha/balanca TODA VEZ que troca de tela,
# nao so ocasionalmente): montar uma tela nova executa muito codigo ainda
# fora do cache, e cada instrucao buscada na PSRAM disputa com o DMA de
# video bem na hora de pico. Desligando para testar. Se o build falhar
# com overflow de IRAM/DROM, essas flags eram necessarias por causa do
# tamanho do binario e precisamos de outra saida (reduzir codigo em IRAM
# ou aceitar o tradeoff); se o build passar, teste se o embaralhamento
# sumiu.
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
# CONFIG_SPIRAM_RODATA=y

# REVERTIDO — CONFIG_LCD_RGB_ISR_IRAM_SAFE=y parecia certo (deixa a ISR do
# bounce buffer rodar mesmo com o cache de flash desabilitado por acesso a
# NVS), mas causa PANIC: o framebuffer esta em PSRAM (fb_in_psram=1, ver
# bsp_lcd_rgb.c) e PSRAM tambem depende do MESMO cache que fica desabilitado
# durante nvs_flash_init()/leituras NVS. A ISR "IRAM-safe" passa a rodar
# nessa janela e tenta ler o framebuffer em PSRAM -> "Cache disabled but
# cached memory region accessed" -> crash no boot (visto em
# lcd_rgb_panel_fill_bounce_buffer, chamado de nvs_flash_init via
# app_dash_profile_init). So funciona com bounce buffer fonte em SRAM
# interna, nao e o nosso caso. NAO reativar sem mover o framebuffer pra
# fora da PSRAM.
# CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Quando o driver RGB precisar reiniciar uma transmissao apos um underflow do
# bounce buffer, espere o VSYNC. Sem isto o reinicio pode ocorrer no meio do
# quadro e aparece como deslocamento/"chacoalhada" horizontal. Nao elimina a
# causa de um underflow, mas elimina o quadro visualmente corrompido.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_SPI_FLASH_HPM_ENA=y

# O RGB DMA, LVGL e bounce buffer exigem margem de CPU e barramento. Estes
# valores sao os recomendados pela Waveshare para o benchmark da 4.3B.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# BLE via NimBLE (app_ble)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Default (INFO) faz o host logar cada advertising/scan report continuamente
# no monitor serial; WARNING deixa so erros/avisos.
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# Incidente real em hardware (2026-09-01): conectar no periferico de debug
# BLE (components/app_map_debug_ble/) com um celular (nRF Connect) travava
# o sistema logo apos "conectado" — log mostrava "BLE_INIT: Malloc failed"
# bem na hora do connect/disconnect. Causa: o padrao do ESP-IDF pra MTU
# preferido do ATT e 256 bytes; nRF Connect pede MTU grande automaticamente
# ao conectar, e o controlador BT tenta alocar buffers proporcionais a
# isso — numa placa ja apertada de RAM interna (framebuffer RGB + pool
# fixo de 64KB da LVGL, ver ui_screen_map.c), essa alocação falha. Nenhuma
# funcionalidade deste projeto precisa de MTU grande: telemetria (18
# bytes) e os PDUs de mapa (ate 18 bytes) cabem inteiros no MTU MINIMO do
# BLE (23 — 20 bytes uteis), entao reduzir isso nao quebra nada documentado.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23

# Continuação do incidente acima — o MTU sozinho não foi suficiente (ainda
# travava com "BLE_INIT: Malloc failed" ao trocar de tela ou mandar dados
# pelo BLE de debug). Números reais coletados em campo (log [DIAG-BLE-MEM],
# 2026-09-01): mesmo OCIOSA, a placa roda com uns 560 bytes livres de RAM
# interna — framebuffer/bounce buffer do RGB + pool fixo da LVGL + tudo
# mais já consomem quase tudo (ver ROADMAP.md). Reduzir o número máximo de
# conexões simultâneas (o host NimBLE dimensiona 3 pools estáticos a partir
# disso — ver ble_hs_conn.c/ble_gatts.c/ble_hs_hci_evt.c) e a profundidade
# dos pools de buffer abaixo (não o tamanho de cada bloco) devolve ~9KB de
# RAM sem tirar nenhuma funcionalidade usada: este projeto só tem 1 conexão
# BLE por vez (um celular no debug, ou futuramente 1 ligação com a ECU
# STM32 — nunca as duas juntas) e tráfego baixo (PDUs de até 18 bytes, um a
# cada ~20ms).
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_WHITELIST_SIZE=1
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=8
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=8

# Partição "factory" de 1MB (single-app padrão) ficou pequena depois dos
# componentes novos (app_ecu/app_pedal_link/app_sim/app_dash_profile) —
# binário passou de 1MB por ~4KB. "Large" usa 1500K, com folga (flash tem
# 16MB, sobra espaço de sobra). Ver README.md sobre apagar o sdkconfig e
# rodar Reconfigure Project pra isso realmente ser aplicado.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Sem isso, o sprintf embutido do LVGL (CONFIG_LV_USE_BUILTIN_SPRINTF) NÃO
# processa "%f" — qualquer lv_label_set_text_fmt com número decimal (bateria,
# AFR, lambda, G-force, mínimo/máximo) imprime lixo tipo "fV" em vez do
# número. Faltou desde o início do porting; só apareceu agora que o
# dashboard passou a mostrar mais números decimais.
CONFIG_LV_USE_FLOAT=y
